 Task 3: Pandas CSV Load

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sample data.csv')
df

     NAME  AGE
0   Vijay   20
1    Arun   22
2    Sita   20
3   Surya   26
4  Vaishu   23
5   Ajith   30
6     Bob   25
7   Clara   27

In [3]:
df.head(4)

    NAME  AGE
0  Vijay   20
1   Arun   22
2   Sita   20
3  Surya   26

In [4]:
df.info

<bound method DataFrame.info of      NAME  AGE
0   Vijay   20
1    Arun   22
2    Sita   20
3   Surya   26
4  Vaishu   23
5   Ajith   30
6     Bob   25
7   Clara   27>

In [5]:
df.describe

<bound method NDFrame.describe of      NAME  AGE
0   Vijay   20
1    Arun   22
2    Sita   20
3   Surya   26
4  Vaishu   23
5   Ajith   30
6     Bob   25
7   Clara   27>

In [7]:
df.tail(2)

    NAME  AGE
6    Bob   25
7  Clara   27